# 第06章 数据加载、存储与文件格式


## 6.1 读写文本格式的数据

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
pd.read_table('ex1.csv',sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_csv('ex2.csv',header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [5]:
pd.read_csv('ex2.csv',names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
names = ['a','b','c','d','message']
pd.read_csv('ex2.csv',names = names,index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
parsed = pd.read_csv('csv_mindex.csv',index_col = ['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [8]:
list(open('ex3.txt'))

['            A         B         C,\n',
 ' aaa -0.264438 -1.026059 -0.619500,\n',
 ' bbb  0.927272  0.302904 -0.032399,\n',
 ' ccc -0.264273 -0.386314 -0.217601,\n',
 ' ddd -0.871858 -0.348382  1.100491']

In [9]:
result = pd.read_table('ex3.txt',sep = '\s+')
result

            A         B          C,
aaa -0.264438 -1.026059  -0.619500,
bbb  0.927272  0.302904  -0.032399,
ccc -0.264273 -0.386314  -0.217601,
ddd -0.871858 -0.348382    1.100491

In [10]:
pd.read_csv('ex4.csv',skiprows = [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
result = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [12]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [13]:
result = pd.read_csv('ex5.csv',na_values = ['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [14]:
sentinels = {'message':['foo','NA'],'something':['two']}
pd.read_csv('ex5.csv',na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [15]:
pd.options.display.max_rows = 10

In [16]:
result = pd.read_csv('d_train.csv',encoding = 'gbk')
result

,id,性别,年龄,体检日期,*天门冬氨酸氨基转换酶,*丙氨酸氨基转换酶,*碱性磷酸酶,*r-谷氨酰基转换酶,*总蛋白,白蛋白,...,血小板计数,血小板平均体积,血小板体积分布宽度,血小板比积,中性粒细胞%,淋巴细胞%,单核细胞%,嗜酸细胞%,嗜碱细胞%,血糖
0,1,男,41,12/10/2017,24.96,23.10,99.59,20.23,76.88,49.60,...,166.0,9.9,17.4,0.164,54.1,34.2,6.5,4.7,0.6,6.06
1,2,男,41,19/10/2017,24.57,36.25,67.21,79.00,79.43,47.76,...,277.0,9.2,10.3,0.260,52.0,36.7,5.8,4.7,0.8,5.39
2,3,男,46,26/10/2017,20.82,15.23,63.69,38.17,86.23,48.00,...,241.0,8.3,16.6,0.199,48.1,40.3,7.7,3.2,0.8,5.59
3,4,女,22,25/10/2017,14.99,10.59,74.08,20.22,70.98,44.02,...,252.0,10.3,10.8,0.260,41.7,46.5,6.7,4.6,0.5,4.30
4,5,女,48,26/10/2017,20.07,14.78,75.79,22.72,78.05,41.83,...,316.0,11.1,14.0,0.350,56.6,33.1,9.1,0.6,0.6,5.42
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5637,5728,女,47,10/10/2017,18.82,14.56,54.02,14.75,77.44,44.27,...,200.0,10.6,12.0,0.210,48.8,43.3,6.5,0.7,0.7,5.45
5638,5729,女,31,10/10/2017,21.08,13.07,76.03,13.80,80.72,47.21,...,210.0,11.1,13.7,0.230,60.6,31.3,5.5,1.6,1.0,5.13
5639,5730,女,80,10/10/2017,22.95,21.51,106.37,32.88,75.29,40.43,...,323.0,10.4,12.6,0.340,61.1,30.1,6.0,2.2,0.6,5.24
5640,5731,女,55,10/10/2017,33.54,24.94,97.60,19.16,78.50,43.10,...,220.0,12.2,16.3,0.270,55.0,36.9,6.8,0.7,0.6,6.37
5641,5732,女,30,10/10/2017,21.37,20.77,52.54,26.94,79.86,49.25,...,367.0,9.9,10.8,0.360,58.5,31.2,5.8,3.7,0.8,6.00

In [17]:
pd.read_csv('d_train.csv',nrows = 5, encoding = 'gbk')

,id,性别,年龄,体检日期,*天门冬氨酸氨基转换酶,*丙氨酸氨基转换酶,*碱性磷酸酶,*r-谷氨酰基转换酶,*总蛋白,白蛋白,...,血小板计数,血小板平均体积,血小板体积分布宽度,血小板比积,中性粒细胞%,淋巴细胞%,单核细胞%,嗜酸细胞%,嗜碱细胞%,血糖
0,1,男,41,12/10/2017,24.96,23.10,99.59,20.23,76.88,49.60,...,166,9.9,17.4,0.164,54.1,34.2,6.5,4.7,0.6,6.06
1,2,男,41,19/10/2017,24.57,36.25,67.21,79.00,79.43,47.76,...,277,9.2,10.3,0.260,52.0,36.7,5.8,4.7,0.8,5.39
2,3,男,46,26/10/2017,20.82,15.23,63.69,38.17,86.23,48.00,...,241,8.3,16.6,0.199,48.1,40.3,7.7,3.2,0.8,5.59
3,4,女,22,25/10/2017,14.99,10.59,74.08,20.22,70.98,44.02,...,252,10.3,10.8,0.260,41.7,46.5,6.7,4.6,0.5,4.30
4,5,女,48,26/10/2017,20.07,14.78,75.79,22.72,78.05,41.83,...,316,11.1,14.0,0.350,56.6,33.1,9.1,0.6,0.6,5.42

In [18]:
chunker = pd.read_csv('d_train.csv',chunksize = 1000, encoding = 'gbk')
chunker

In [19]:
chunker = pd.read_csv('d_train.csv',chunksize = 1000,encoding = 'gbk')
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['id'].value_counts(),fill_value = 0)
tot = tot.sort_values(ascending = False)
tot[:10]

5732    1.0
1789    1.0
1901    1.0
1902    1.0
1903    1.0
1904    1.0
1905    1.0
1906    1.0
1907    1.0
1908    1.0
dtype: float64

### 将数据写出到文本格式

In [20]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
data.to_csv('out.csv')

In [22]:
import sys
data.to_csv(sys.stdout,sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [23]:
data.to_csv(sys.stdout,na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [24]:
data.to_csv(sys.stdout,index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [25]:
dates  = pd.date_range('1/1/2000',periods = 7)
ts = pd.Series(np.arange(7),index = dates)
ts.to_csv('tseries.csv')

### 处理分隔符格式

In [26]:
import csv 
f = open('ex7.csv')
reader = csv.reader(f)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [27]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))
header,values = lines[0],lines[1:]
data_dict = {h: v for h, v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [28]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(data_dict,dialect=my_dialect)

In [29]:
reader = csv.reader(data_dict, delimiter='|')

In [30]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

### JSON数据

In [31]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [32]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [33]:
asjson = json.dumps(result)
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [34]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [35]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [36]:
 print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML和HTML：Web信息收集

In [37]:
#tables = pd.read_html('fdic_failed_bank_list.html')

In [38]:
#len(tables)

In [39]:
#failures = tables[0]
#failures.head()

In [40]:
#close_timestamps = pd.to_datetime(failures['Closing Date'])
#close_timestamps.dt.year.value_counts()

### 利用lxml.objectify解析XML

In [41]:
from lxml import objectify

In [42]:
path = 'Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [43]:
#data = []

#skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
#               'DESIRED_CHANGE', 'DECIMAL_PLACES']

#for elt in root.INDICATOR:
#    el_data = {}
#    for child in elt.getchildren():
#        if child.tag in skip_fields:
#            continue
#        el_data[child.tag] = child.pyval
#    data.append(el_data)

In [44]:
perf = pd.DataFrame(data)
perf.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [45]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [46]:
root

In [47]:
root.get('href')

'http://www.google.com'

In [48]:
root.text

'Google'

## 6.2 二进制数据格式

In [49]:
frame = pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [50]:
frame.to_pickle('frame_pickle')

### 使用HDF5格式

In [51]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [52]:
store['obj1']

           a
0  -1.071557
1   1.896071
2   1.025745
3   1.225776
4   0.152732
..       ...
95 -0.551757
96 -0.919167
97 -0.858221
98 -0.152909
99 -0.443845

[100 rows x 1 columns]

In [53]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.946931
11  1.338928
12 -1.282139
13 -0.687211
14  0.726214
15  1.611502

In [54]:
store.close()

In [55]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -1.071557
1  1.896071
2  1.025745
3  1.225776
4  0.152732

### 读取Microsoft Excel文件

In [56]:
xlsx = pd.ExcelFile('各城市时间间隔.xlsx')
pd.read_excel(xlsx, '成都')

     时间间隔    计数
0       1  1158
1       2   410
2       3   349
3       4   240
4       5   219
..    ...   ...
382   437     2
383   439     1
384   447     1
385   452     1
386   473     1

[387 rows x 2 columns]

In [57]:
frame = pd.read_excel('各城市时间间隔.xlsx', '成都')
frame

     时间间隔    计数
0       1  1158
1       2   410
2       3   349
3       4   240
4       5   219
..    ...   ...
382   437     2
383   439     1
384   447     1
385   452     1
386   473     1

[387 rows x 2 columns]

In [58]:
writer = pd.ExcelWriter('ex2.xlsx')

In [59]:
frame.to_excel(writer, 'Sheet1')
writer.save()

In [60]:
frame.to_excel('ex2.xlsx')

## 6.3 Web APIs交互

In [61]:
import requests

In [62]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [63]:
resp = requests.get(url)

In [64]:
resp

In [65]:
data = resp.json()
data[0]['title']

'CLN: Remove never-True Block.is_sparse'

In [66]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,27037,CLN: Remove never-True Block.is_sparse,[],open
1,27036,df.plot() does not work for time series after ...,[],open
2,27035,Unstable hashtable / duplicated algo for objec...,"[{'id': 57296398, 'node_id': 'MDU6TGFiZWw1NzI5...",open
3,27034,API/REGR: Convert to float for index union,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
4,27033,fixes qcut failing for labels = True,[],open
...,...,...,...,...
25,27008,to_excel Mishandles Mixing of tz-aware datetimes,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,27006,BUG: XlsxWriter ignoring formats on numpy type...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
27,27003,AssertionError with DataFrame.from_records() w...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
28,27000,Proposal: Shorter default Series/DataFrame rep...,"[{'id': 13101118, 'node_id': 'MDU6TGFiZWwxMzEw...",open
29,26999,to_excel() TyperError: Unsupported type <class...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open

## 6.4 数据库交互

In [67]:
import sqlite3

In [70]:
query = """
   CREATE TABLE test01
    (a VARCHAR(20), b VARCHAR(20),
    c REAL,        d INTEGER
  );"""

In [71]:
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [72]:
con.commit()

In [76]:
data = [('Atlanta', 'Georgia', 1.25, 6),
   ('Tallahassee', 'Florida', 2.6, 3),
   ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test01 VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)

In [78]:
cursor = con.execute('select * from test01')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [79]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [80]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [81]:
import sqlalchemy as sqla

In [83]:
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test',db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []